#include "句子生成方法.h"

//汉字从数据中调用

//句子根据方法（句子语法）进行汉字拼合，然后输出

//句子意思符合累积的交流的语料库

//当语料库相对较少的时候，进行人工监督修正句子的含义是否正确，并给与改正

//对句子的含义正确与错误建立一个分析方法，让ai自动判断句子含义是否是正确的


void 汉字的调用(){

	//从数据库中读取汉字

	//根据句子语法进行句子组合

	//随机输出一个句子

	//检测句子的语法是否正确

}




void  句子含义调用() {

	//从语料库中查找句子匹配度相似的句子

	//从经验知识库中查找匹配句子

	//根据方法分析句子的含义，一般的句子都是对主语的属性或者行为状态进行陈述表达

	//根据句子语法进行重新整理句子表达进行输出

	//人工监督句子表达是否和之前的句子含义相同

	//如果含义不同 则进行修正并记录错误的原因

	//再次重新生成新的句子表达（调用汉字调用方法）

	//如果含义错误则继续修正（是语法错误还是结构错误进行明确）

	//再次重新生成新的句子表达 ，直到句子含义正确

	//句子含义正确后 则核心驱动中 能力+1，金钱+1
}