#include "常用反义词字典.h"



void 常用反义词字典初始化() {
	map<string, string> 常用反义词dict;

	;
	常用反义词dict["小"] = "大";
	常用反义词dict["前"] = "后";
	常用反义词dict["左"] = "右";
	常用反义词dict["多"] = "少";
	常用反义词dict["老"] = "少";
	常用反义词dict["来"] = "去";
	常用反义词dict["男"] = "女";
	常用反义词dict["黑"] = "白";
	常用反义词dict["里"] = "外";
	常用反义词dict["高"] = "低";
	常用反义词dict["粗"] = "细";
	常用反义词dict["远"] = "近";
	常用反义词dict["古"] = "今";
	常用反义词dict["明"] = "暗";
	常用反义词dict["早"] = "晚";
	常用反义词dict["有"] = "无";
	常用反义词dict["出"] = "入";
	常用反义词dict["宽"] = "窄";
	常用反义词dict["买"] = "卖";
	常用反义词dict["南"] = "北";
	常用反义词dict["首"] = "尾";
	常用反义词dict["西"] = "东";
	常用反义词dict["始"] = "终";
	常用反义词dict["干"] = "湿";
	常用反义词dict["公"] = "私";
	常用反义词dict["美"] = "丑";
	常用反义词dict["薄"] = "厚";
	常用反义词dict["咸"] = "淡";
	常用反义词dict["甘"] = "甜";
	常用反义词dict["天"] = "地";
	常用反义词dict["稠"] = "稀";
	常用反义词dict["旧"] = "新";
	常用反义词dict["晴"] = "阴";
	常用反义词dict["浮"] = "沉";
	常用反义词dict["假"] = "真";
	常用反义词dict["强"] = "弱";
	常用反义词dict["对"] = "错";
	常用反义词dict["开"] = "关";
	常用反义词dict["硬"] = "软";
	常用反义词dict["深"] = "浅";
	常用反义词dict["加"] = "减";
	常用反义词dict["负"] = "正";
	常用反义词dict["降"] = "升";
	常用反义词dict["冷"] = "热";
	常用反义词dict["饱"] = "饿";
	常用反义词dict["死"] = "生";
	常用反义词dict["反"] = "正";
	常用反义词dict["直"] = "弯";
	常用反义词dict["长"] = "短";
	常用反义词dict["胜"] = "败";
	常用反义词dict["好"] = "坏";
	常用反义词dict["快"] = "慢";
	常用反义词dict["双"] = "单";
	常用反义词dict["熟"] = "生";
	常用反义词dict["歪"] = "正";
	常用反义词dict["笑"] = "哭";
	常用反义词dict["吸"] = "呼";
	常用反义词dict["退"] = "进";
	常用反义词dict["阳"] = "阴";
	常用反义词dict["优"] = "劣";
	常用反义词dict["日"] = "夜";
	常用反义词dict["紧"] = "松";
	常用反义词dict["轻"] = "重";
	常用反义词dict["香"] = "臭";
	常用反义词dict["胖"] = "瘦";
	常用反义词dict["后"] = "先";
	常用反义词dict["易"] = "难";
	常用反义词dict["忙"] = "闲";
	常用反义词dict["爱"] = "憎";
	常用反义词dict["贵"] = "贱";
	常用反义词dict["送"] = "迎";
	常用反义词dict["动"] = "静";
	常用反义词dict["仰"] = "俯";
	常用反义词dict["吞"] = "吐";
	常用反义词dict["浊"] = "清";
	常用反义词dict["输"] = "赢";
	常用反义词dict["悲"] = "喜";
	常用反义词dict["劳"] = "逸";
	常用反义词dict["凹"] = "凸";
	常用反义词dict["矮"] = "高";
	常用反义词dict["利"] = "弊";
	常用反义词dict["此"] = "彼";
	常用反义词dict["盾"] = "矛";
	常用反义词dict["贬"] = "褒";
	常用反义词dict["涝"] = "旱";
	常用反义词dict["简"] = "繁";
	常用反义词dict["安全"] = "危险";
	常用反义词dict["优点"] = "缺点";
	常用反义词dict["晴天"] = "阴天";
	常用反义词dict["寒冷"] = "温暖";
	常用反义词dict["喜欢"] = "讨厌";
	常用反义词dict["复杂"] = "简单";
	常用反义词dict["胆小"] = "勇敢";
	常用反义词dict["早晨"] = "徬晚";
	常用反义词dict["责备"] = "称赞";
	常用反义词dict["坚硬"] = "柔软";
	常用反义词dict["现实"] = "幻想";
	常用反义词dict["软弱"] = "刚强";
	常用反义词dict["暗淡"] = "明亮";
	常用反义词dict["缓和"] = "紧张";
	常用反义词dict["迅速"] = "缓慢";
	常用反义词dict["乐观"] = "悲观";
	常用反义词dict["干净"] = "肮脏";
	常用反义词dict["喜悦"] = "悲伤";
	常用反义词dict["沉着"] = "慌张";
	常用反义词dict["凶恶"] = "善良";
	常用反义词dict["轻巧"] = "笨重";
	常用反义词dict["繁重"] = "轻松";
	常用反义词dict["火热"] = "冰冷";
	常用反义词dict["浪费"] = "节省";
	常用反义词dict["迟钝"] = "灵敏";
	常用反义词dict["怀疑"] = "相信";
	常用反义词dict["喧哗"] = "安静";
	常用反义词dict["动摇"] = "坚定";
	常用反义词dict["黑暗"] = "光明";
	常用反义词dict["表扬"] = "批评";
	常用反义词dict["先进"] = "落后";
	常用反义词dict["敌人"] = "期友";
	常用反义词dict["秘密"] = "公开";
	常用反义词dict["快乐"] = "悲哀";
	常用反义词dict["扩大"] = "缩小";
	常用反义词dict["笨拙"] = "灵巧";
	常用反义词dict["潮湿"] = "干燥";
	常用反义词dict["和蔼"] = "粗暴";
	常用反义词dict["憎恨"] = "热爱";
	常用反义词dict["隐瞒"] = "坦白";
	常用反义词dict["暴露"] = "隐蔽";
	常用反义词dict["陌生"] = "熟悉";
	常用反义词dict["糟蹋"] = "爱惜";
	常用反义词dict["惩罚"] = "奖励";
	常用反义词dict["困难"] = "容易";
	常用反义词dict["降落"] = "升起";
	常用反义词dict["白天"] = "黑夜";
	常用反义词dict["欢送"] = "迎接";
	常用反义词dict["成功"] = "失败";
	常用反义词dict["爱护"] = "损害";
	常用反义词dict["幸福"] = "痛苦";
	常用反义词dict["正确"] = "错误";
	常用反义词dict["认真"] = "马虎";
	常用反义词dict["明白"] = "糊涂";
	常用反义词dict["稠密"] = "稀疏";
	常用反义词dict["提倡"] = "禁止";
	常用反义词dict["弯曲"] = "笔直";
	常用反义词dict["永久"] = "暂时";
	常用反义词dict["结束"] = "开始";
	常用反义词dict["忧愁"] = "高兴";
	常用反义词dict["冷淡"] = "热情";
	常用反义词dict["粗糙"] = "光滑";
	常用反义词dict["矮小"] = "高大";
	常用反义词dict["愚蠢"] = "聪明";
	常用反义词dict["强烈"] = "微弱";
	常用反义词dict["勤劳"] = "懒惰";
}
/*
上对下，小对大。前对后，左对右。
多对少，老对少。来对去，男对女。
黑对白，里对外。高对低，粗对细。
远对近，古对今。明对暗，早对晚。
有对无，出对入。宽对窄，买对卖

南对北，首对尾。西对东，始对终。
干对湿，公对私。美对丑，薄对厚
咸对淡，甘对甜。天对地，稠对稀
旧对新，晴对阴。浮对沉，假对真
强对弱，对对错。开对关；硬对软。


深对浅，加对减。负对正，降对升。
冷对热，饱对饿。死对生，反对正。
直对弯，长对短。胜对败，好对坏。
快对慢，双对单。熟对生，歪对正
笑对哭，吸对呼。退对进，阳对阴



优对劣，日对夜。紧对松，轻对重。
香对臭，胖对瘦。后对先，易对难。
冷对暖，忙对闲。爱对憎，贵对贱。
送对迎，动对静。仰对俯，吞对吐。
浊对清，输对赢。悲对喜，劳对逸。

凹对凸，矮对高。利对弊，此对彼。
盾对矛，贬对褒。涝对旱，简对繁。


安全对危险，优点对缺点。
晴天对阴天，寒冷对温暖。
喜欢对讨厌，复杂对简单
胆小对勇敢，早晨对徬晚。


责备对称赞，坚硬对柔软。
现实对幻想，软弱对刚强。
暗淡对明亮，缓和对紧张。
迅速对缓慢，乐观对悲观。

干净对肮脏，喜悦对悲伤。
沉着对慌张，凶恶对善良。
轻巧对笨重，繁重对轻松。
火热对冰冷，浪费对节省。


迟钝对灵敏，怀疑对相信。
喧哗对安静，动摇对坚定。
黑暗对光明，表扬对批评。
先进对落后，敌人对期友。


秘密对公开，快乐对悲哀。
扩大对缩小，笨拙对灵巧。
潮湿对干燥，和蔼对粗暴。
憎恨对热爱，隐瞒对坦白。


暴露对隐蔽，陌生对熟悉。
糟蹋对爱惜，惩罚对奖励
困难对容易，降落对升起。
白天对黑夜，欢送对迎接。


成功对失败，爱护对损害。
幸福对痛苦，正确对错误。
认真对马虎，明白对糊涂。
稠密对稀疏，清晰对模糊。


提倡对禁止，弯曲对笔直。
永久对暂时，结束对开始
忧愁对高兴，冷淡对热情。
粗糙对光滑，矮小对高大。


愚蠢对聪明，动摇对坚定。
强烈对微弱，勤劳对懒惰。


*/