#pragma once
#pragma once
#include <iostream>

using namespace std;

#include <string>


#include <fstream>

#include<sstream>

#include <algorithm>

#include <map>



//由于所有汉字有4万左右，所以先从现代汉语常用字(2500字)开始
//按照字的笔画分类
void 一画常用汉字();

//二画
void 二画常用汉字();

//三画
void 三画常用汉字();

//四画
void 四画常用汉字();


//五画
void 五画常用汉字();


//六画
void 六画常用汉字();
//七画

void 七画常用汉字();
//八画
void 八画常用汉字();
//九画

void 九画常用汉字();


//十画
void 十画常用汉字();

//十一画
void 十一画常用汉字();


//十二画

void 十二画常用汉字();

//十三画
void 十三画常用汉字();

//十四画
void 十四画常用汉字();

//十五画
void 十五画常用汉字();

//十六画
void 十六画常用汉字();

// 十七画
void 十七画常用汉字();

//十八画
void 十八画常用汉字();


///十九画
void 十九画常用汉字();


//二十画
void 二十画常用汉字();


//二十一画

void 二十一画常用汉字();


//二十二画
void 二十二画常用汉字();

//二十三画
void 二十三画常用汉字();


//现代汉语次常用字(1000字)

//二画次

void 二画次常用汉字();


//四画次

void 四画次常用汉字();


//五画次

void 五画次常用汉字();


//六画次

void 六画次常用汉字();


//七画次

void 七画次常用汉字();


//八画次

void 八画次常用汉字();


//九画次

void 九画次常用汉字();



//十画次

void 十画次常用汉字();



//十一画次

void 十一画次常用汉字();


//十二画次

void 十二画次常用汉字();


//十三画次

void 十三画次常用汉字();

//十四画次

void 十四画次常用汉字();

//十五画次

void 十五画次常用汉字();

//十六画次

void 十六画次常用汉字();

//十七画次

void 十七画次常用汉字();


//十八画次

void 十八画次常用汉字();

//十九画次

void 十九画次常用汉字();

//二十画次

void 二十画次常用汉字();

//二十一画次

void 二十一画次常用汉字();

//二十二画次

void 二十二画次常用汉字();

//二十三画次

void 二十三画次常用汉字();