#include "词性定义.h"

void 词性定义() {
	map<string, string> 词性定义dict;


	词性定义dict["形容词"] = "表示描绘事物的形状、颜色、特点等属性的词语。";
	词性定义dict["副形词"] = "修饰形容词的词语，表示程度、范围等。";
	词性定义dict["形容词性语素"] = "构成形容词的语法单位。";
	词性定义dict["名形词"] = "表示属性的名词。";
	词性定义dict["区别词"] = "表示比较、区别的词语。";
	词性定义dict["连词"] = "连接词语，表示并列、递进、转折等关系。";
	词性定义dict["副词"] = "修饰动词、形容词、其他副词等词语，表示程度、方式、时间、地点、程度等。";
	词性定义dict["叹词"] = "表示情感的词语，如惊叹、赞美、嘘声等。";
	词性定义dict["方位词"] = "表示方向、位置等概念的词语。";
	词性定义dict["语素字头头"] = "构成词素的语法单位，作为其他词素的前缀。";
	词性定义dict["前缀"] = "词语前面加上的一个词汇成分，如“超级”、“不可”等。";
	词性定义dict["成语"] = "由多个汉字组成的固定词组，有固定含义。";
	词性定义dict["简称略语"] = "对某个复合名称进行缩写或取首字母而得到的词语，在特定领域广泛使用。";
	词性定义dict["后缀"] = "词语后面加上的一个词汇成分，如“爱好者”、“干员”等。";
	词性定义dict["习用语"] = "因习惯成为用法固定的词语。";
	词性定义dict["数词"] = "表示数目、数量、序数等概念的词语。";
	词性定义dict["普通名词"] = "表示人、事物、抽象概念等的词语。";
	词性定义dict["名词性语素"] = "构成名词的语法单位。";
	词性定义dict["人名"] = "表示人名的专有名词。";
	词性定义dict["地名"] = "表示地名的专有名词。";
	词性定义dict["机构团体名"] = "表示机构、组织或团体的专有名词。";
	词性定义dict["其他专名"] = "表示专有名词中除人名、地名、机构团体名之外的其他专史名词。";
	词性定义dict["拟声词"] = "表示声音、动作、表情等的词语。";
	词性定义dict["介词"] = "表示词语间的关系，如时间、地点、方式、原因等。";
	词性定义dict["量词"] = "表示计量单位的词语。";
	词性定义dict["代词"] = "替代名词的词语，表示人或事物。";
	词性定义dict["处所词"] = "表示位置、方位、地点、范围等的词语。";
	词性定义dict["时间词"] = "表示时间、时刻、年月等的词语。";
	词性定义dict["助词"] = "辅助其他词语的词汇成分，用于表达语气、句法关系等。";
	词性定义dict["动词"] = "表示动作、状态、变化等的词语。";
	词性定义dict["副动词"] = "表示副词和动词的组合，一般表示强调、修饰等。";
	词性定义dict["动词性语素"] = "构成动词的语法单位。";
	词性定义dict["名动词"] = "表示动作或状态的名词，与动词构成近义词。";
	词性定义dict["标点符号"] = "用于书写、标点或端口句子的符号。";
	词性定义dict["非语素字"] = "表示不属于任何语素的字符，如标点符号、“的”、“啊”等。";
	词性定义dict["语气词"] = "表示语气的词语，如感叹、疑问等。";
	词性定义dict["状态词"] = "表示状态、性质或特点的词语。";
	


}

